docs/transferts/requests/XDSITI43RetrieveDocumentSet.http

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:ReplyTo soapenv:mustUnderstand="1">
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:ReplyTo>
      <wsa:To>https://ws.b2b.cara.test.post-ehealth.ch/Repository/services/RepositoryService</wsa:To>
      <wsa:MessageID>urn:uuid:7a6fb6b3-7976-4f4d-b06e-30fb06239523</wsa:MessageID>
      <wsa:Action>urn:ihe:iti:2007:RetrieveDocumentSet</wsa:Action>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
	  <!-- insert Assertion without pretty print ! -->

           <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_eba64969-5b5c-4e92-84ff-a448a151f6a6" IssueInstant="2021-02-26T12:42:22.073Z" Version="2.0" xsi:type="saml2:AssertionType"><saml2:Issuer>Post.CH B2B STS</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_eba64969-5b5c-4e92-84ff-a448a151f6a6"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>dXA3TpPMp0i7Gh9UNMCAWbwOVr0=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>H3tzZ7XL96qLZ6tP0eru+at765EVBu5yio0y5+gHejS4hPathyY1sbs0pCHABSPpoSbTPHR1jlmv5yeWDgoApUVOPUI8k+qGyevf/Di0cqOjumuyl6v2vBbYwuNpjelzhQ+fge8p9CT/kXtGnxugJzpvouwLgsCM0b2Nau0qXOXeslc3P8gmkExHe6UOk4fUgOoY7ukLpdyV2O9Mz0Tto3fgWvs4qeK61v1dgtzz8o2uKyzzUpHiZVtduRt21oxn6b83f+aCTla9tFEb0mbh3bD2BAzUV8IMCmN8EgUFX9FeY0seXDbtTK23VR816kRW3YkN1uOZCdgzFMH2pkv0521haiUG0inHJa3jwPCj9BfxyYWYFQZsFgKukOMtOHv7u4ui5ewdJ35Xji8K3qPM6G8xuEj1mjnbpGbVr9jNl/IMQsJZXLezcMo+MUl/ubNm/lx/ONARspj8GBbkuvHhCL1iLQ59IaH0LqgeL2INuueDYvcVR1kRjAhPmL5IUySTQf7EAN0JkiX460kyk3qy0iVdNA4lQ70Gxf3rFvO0uyarJmZJ//Xtrqt5/WKH95irvdm+cGGZaIClefANF5/tGMI8VsmF3ksamVspNlOmyNnRXIdsoeBUUNtbk+LMOZRMn6lYhaQwUp4nA3vzLwCkfeIVFtINT6O5WEUpeop5Dis=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIHgTCCBmmgAwIBAgIUSq/VFM5TciRMT22Go4GeLQm/snkwDQYJKoZIhvcNAQELBQAwVDELMAkG
A1UEBhMCQ0gxFTATBgNVBAoTDFN3aXNzU2lnbiBBRzEuMCwGA1UEAxMlU3dpc3NTaWduIFBlcnNv
bmFsIEdvbGQgQ0EgMjAxNCAtIEcyMjAeFw0xOTA1MTMxMjExNDFaFw0yMjA1MTMxMjExNDFaMIGi
MQswCQYDVQQGEwJDSDENMAsGA1UECBMEQmVybjETMBEGA1UEChMKUG9zdCBDSCBBRzEcMBoGA1UE
CxMTRS1IZWFsdGggT3BlcmF0aW9uczEqMCgGCSqGSIb3DQEJARYbb3BlcmF0aW9ucy5lLWhlYWx0
aEBwb3N0LmNoMSUwIwYDVQQDExxwc2V1ZG86IFNBTUwgU2lnbmVyIENhcmEgSU5UMIICIjANBgkq
hkiG9w0BAQEFAAOCAg8AMIICCgKCAgEApnD4yANHIlhND2n6gmqMivDHcpQl9iEaZhlOmRIhSysE
rsB2YuTfc3M0myY+YCbIQLv560OPN81IFBwFtnvzBe8cFRrsZ+a5WW60lTTNfcyNz7QExuCI29uE
jIkSHcQj1sITOvtcHzKNkGEOdjSbdbeYk6ON0jQ3fI1IEk4k2W5csjDG13/KLJJP/01l+5o29qdu
lyDw/ttAjr4GjulSmS1nIRcj5e6JmxT6EGfUIOItWvdC2cCSuH9ZQmPz1YmFgLfUBLf3i6xMFqIe
NufutvGxS9ERnKS1lwXi6zxsEDkr9/nJ1+L2dP08KekxAuKLQU424nQ85ezr8CgcksfG8SunAn79
d7mIQbihhhapJWs9fgcy31pooEcjHHoelmdDLmgtgB/FXluvBZssWawowOiqwAcrzMAOpVv8e4Wd
l0QWp9RH582Wpt31LQ549YoewpikEJjFgFC3AGZDTq5RnBx6wz1Op1Dz4+hpoRc0rhmUqZJC9q5m
qPtOppIrmJ/RbWUFL0DcXsbxT7lHZWaYdqhgGG3jVQ60EU4yPs6kK76xc9nYxTfbSEdpbeCBbfuh
Fwn9ijNvm51safl6H2lDMqQS1aqQzjO0r5q08OaADXAkxKNtIOe0s3msMGXWnbVq0G2pJHMa6n+g
0598lGHf7jBiQlDqZvjL/vOib3UgG3MCAwEAAaOCAvowggL2MCYGA1UdEQQfMB2BG29wZXJhdGlv
bnMuZS1oZWFsdGhAcG9zdC5jaDAOBgNVHQ8BAf8EBAMCA/gwNQYDVR0lBC4wLAYIKwYBBQUHAwIG
CCsGAQUFBwMEBgorBgEEAYI3CgMEBgorBgEEAYI3FAICMB0GA1UdDgQWBBTu+itm8IcoyIWWJ3v7
N6UhZKlMLTAfBgNVHSMEGDAWgBTaMvlJ+FHMmHFmDNnOttuSPwlL7zCB/wYDVR0fBIH3MIH0MEeg
RaBDhkFodHRwOi8vY3JsLnN3aXNzc2lnbi5uZXQvREEzMkY5NDlGODUxQ0M5ODcxNjYwQ0Q5Q0VC
NkRCOTIzRjA5NEJFRjCBqKCBpaCBooaBn2xkYXA6Ly9kaXJlY3Rvcnkuc3dpc3NzaWduLm5ldC9D
Tj1EQTMyRjk0OUY4NTFDQzk4NzE2NjBDRDlDRUI2REI5MjNGMDk0QkVGJTJDTz1Td2lzc1NpZ24l
MkNDPUNIP2NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3Q/YmFzZT9vYmplY3RDbGFzcz1jUkxEaXN0
cmlidXRpb25Qb2ludDBpBgNVHSAEYjBgMFQGCWCFdAFZAQIBCzBHMEUGCCsGAQUFBwIBFjlodHRw
Oi8vcmVwb3NpdG9yeS5zd2lzc3NpZ24uY29tL1N3aXNzU2lnbi1Hb2xkLUNQLUNQUy5wZGYwCAYG
BACPegEBMIHXBggrBgEFBQcBAQSByjCBxzBkBggrBgEFBQcwAoZYaHR0cDovL3N3aXNzc2lnbi5u
ZXQvY2dpLWJpbi9hdXRob3JpdHkvZG93bmxvYWQvREEzMkY5NDlGODUxQ0M5ODcxNjYwQ0Q5Q0VC
NkRCOTIzRjA5NEJFRjBfBggrBgEFBQcwAYZTaHR0cDovL2dvbGQtcGVyc29uYWwtZzIub2NzcC5z
d2lzc3NpZ24ubmV0L0RBMzJGOTQ5Rjg1MUNDOTg3MTY2MENEOUNFQjZEQjkyM0YwOTRCRUYwDQYJ
KoZIhvcNAQELBQADggEBAF3ru+wLgaxMTUXbMglbB9PwyEKjJcB4ijWqPfS0ZxCgj9CPQM03MkWM
lDq/r2PGpL912hxyPh9FyE8V7gekC0+61H7d6IndW3Xzv1zNAkDvUrvwbRinfo0iXXwj1ntBUSAL
jl7FUTOH2jq1AQx0trdmRGslFoy0BjQTwa9YOW1WuUPfHuUC54KbWQW4CQ7Gr5mEQK/RGCVhXfYT
Et0XzfRCi5aptM00ZZ3xsu8noBJ8rr/ib7RRBgzhGYMeOnVeJI23V3B/jk/p89u/uZxg01lgJRPe
DIj4B3DMcJWNjqxdDJ2QrlikCOTFGPRfrzThUf4Terwqxekbe4kgbiLaOWo=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">2.16.756.5.30.1.191.0.1:1560766711013</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/></saml2:Subject><saml2:Conditions NotBefore="2021-02-26T12:42:22.073Z" NotOnOrAfter="2021-02-26T13:42:22.073Z"><saml2:AudienceRestriction><saml2:Audience>http://post.ch/ehealth/b2b</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2021-02-26T12:42:22.073Z"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue>Cédric Michelet</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue><hl7:Role xmlns:hl7="urn:hl7-org:v3" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPD Akteure" displayName="Healthcare Professional" xsi:type="hl7:CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue>unknown</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue>urn:oid:3.14.15.926</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue>unknown^^^&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue><hl7:PurposeOfUse xmlns:hl7="urn:hl7-org:v3" code="NORM" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Normal" xsi:type="hl7:CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:gs1:gln" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue xsi:type="xsd:string">7601001408357</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion>

		  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns3:RetrieveDocumentSetRequest xmlns:ns3="urn:ihe:iti:xds-b:2007">
         <ns3:DocumentRequest>
         <ns3:RepositoryUniqueId>2.16.756.5.30.1.191.0.1.12.1.1.31</ns3:RepositoryUniqueId>
            <ns3:DocumentUniqueId>2.16.756.5.30.1.122.1.9^5134.4</ns3:DocumentUniqueId> <!-- required: DocumentUniqueId -->
         </ns3:DocumentRequest>
      </ns3:RetrieveDocumentSetRequest>
   </soapenv:Body>
</soapenv:Envelope>