ihe-utility/src/test/resources/1367834843923_iti_43_body.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://203.64.84.112:8020/axis2/services/xdsrepositoryb?wsdl</wsa:To>
		<wsa:MessageID>urn:uuid:e475e8e5-6752-4270-a795-781e599fc2ee</wsa:MessageID>
		<wsa:Action>urn:ihe:iti:2007:RetrieveDocumentSet</wsa:Action>
	</soapenv:Header>
	<soapenv:Body xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
		<RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007">
			<DocumentRequest>
				<RepositoryUniqueId>1.3.6.1.4.1.21367.2010.1.2.1125</RepositoryUniqueId>
				<DocumentUniqueId>1.3.6.1.4.1.21367.2010.1.2.127.0.0.1.20130507085811.0</DocumentUniqueId>
			</DocumentRequest>
		</RetrieveDocumentSetRequest>
	</soapenv:Body>
</soapenv:Envelope>